# Практическая работа по уроку "Динамическая типизация"

name=("Rustam")# переменной name присвоено строковое значение Rustam
print("name:",name)# вывод на экран текста "name:" и переменной name

age=53# переменной age присвоено числовое значение
print("age:",age)# вывод на экран текста "age:" и переменной age

new=(age+43)# переменной age присвоено числовое значение (Сумма переменной age и 43)
print("new age:", new)# вывод на экран текста "new age:" и переменной new

is_Student=True# переменной is_Student присвоено логическое значение
print("Is Student:",is_Student)# вывод на экран текста "is Student:" и переменной is_Student