# Практическая работа по уроку "Динамическая типизация"

name=("Rustam")# переменной name присвоено строковое значение Rustam
print("name:",name)# вывод на экран текста "name:" и переменной name

age=53# переменной age присвоено числовое значение
print("age:",age)# вывод на экран текста "age:" и переменной age

age=99# переменной age присвоено числовое значение
print("new age:", age)# вывод на экран текста "age:" и переменной age

is_Student=True# переменной is_Student присвоено логическое значение
print("Is Student:",is_Student)# вывод на экран текста "is Student:" и переменной is_Student