print('Hello world!')#выводит строку "привет мир!"
print(2+8)# выводит результат сложения 10
print('Результат:',10)# выводит несколько объектов: "результат: 10"

print(type(42))# Выводит:(целое число)
print(type(3.14))# Выводит: (число с плавающей точкой)
print(type("Hello"))# Выводит: (строка)
print(type([1,2,3]))# Выводит: (список)
print("Тип данных 42:",type(42))# комбинированные команды

print(5+5)# Сложение
print(5-3)# вычитание
print(5*5)# умножение
print(5**2)# возведение в степень
print(60/5)# деление с плавающей точкой(float)
print(60//5)# деление целочисленное
print(60//7)# деление целочисленное
print(60/7)# деление с плавающей точкой
print(5%3)# остаток от деления
print('Hello,'+'world')# конкатенация, concatenate, сложение текста.
print('1'+'1')# конкатенация, concatenate, сложение текста.
print(int('1'+'1'))# конкатенация, concatenate, сложение текста и после изменение на целочисленный тип
print(int(1+1))# Сложение

print(5>=5)# boolean, логический тип данных. выводит: True- истина
print(5>10)# boolean, логический тип данных. выводит: False- ложь
print(5>10,5<10)# boolean, логический тип данных. выводит: False- ложь, True- истина
print(5==5)# Проверка равенства Выводит True
print(5>=5)# проверка, больше либо равно Выводит True
print(5<=5)# прверка, меньше либо равно Выводит True
print(5!=6)# проверка неравенства Выводит True

print(5!=5 and 5<10)# проверка неравенства 5 и 5, 5<10, and-строгий оператор, если одно уловие не выполнится, выводится False
print(5!=5 or 5<10)# проверка неравенства 5 и 5, 5<10, or-или, если одно условие выполнится, выводится True
print(type(int('123')))# текст "123" преобразуется в числовой тип (int), определяет тип "class int", выводит тип на экран.
